Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПользователю = "Изменилась количество";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПользователю = "Изменилась цена";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстПользователю);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, Сообщение)
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
	ТекстСообщения = Новый СообщениеПользователю();
	ТекстСообщения.Текст = Сообщение;
	ТекстСообщения.Сообщить();
	
КонецПроцедуры

// Описание сотрудника.
// 
// Возвращаемое значение:
//  Структура - Описание сотрудника:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Стаж - Число - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	
	Сотрудник.Вставить("Имя", "Илья");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("Штатный", Ложь);
	
	Возврат Сотрудник;
КонецФункции


Переменная1 = 1;
Переменная1 = "аа";
